MikroElektronika/core_packages/ARM/gcc_clang/system/src/infineon/cy8c4146lde/thirdparty/cy8c4146lde/ip/cyip_sar_v4.h
/***************************************************************************//**
* \file cyip_sar_v4.h
*
* \brief
* SAR IP definitions
*
********************************************************************************
* \copyright
* (c) (2016-2025), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#ifndef _CYIP_SAR_V4_H_
#define _CYIP_SAR_V4_H_

#include "cyip_headers.h"

/*******************************************************************************
*                                     SAR
*******************************************************************************/

#define SAR_SECTION_SIZE                        0x00010000UL

/**
  * \brief SAR ADC with Sequencer (SAR)
  */
typedef struct {
  __IOM uint32_t CTRL;                          /*!< 0x00000000 Analog control register. */
  __IOM uint32_t SAMPLE_CTRL;                   /*!< 0x00000004 Sample control register. */
   __IM uint32_t RESERVED[2];
  __IOM uint32_t SAMPLE_TIME01;                 /*!< 0x00000010 Sample time specification ST0 and ST1 */
  __IOM uint32_t SAMPLE_TIME23;                 /*!< 0x00000014 Sample time specification ST2 and ST3 */
  __IOM uint32_t RANGE_THRES;                   /*!< 0x00000018 Global range detect threshold register. */
  __IOM uint32_t RANGE_COND;                    /*!< 0x0000001C Global range detect mode register. */
  __IOM uint32_t CHAN_EN;                       /*!< 0x00000020 Enable bits for the channels */
  __IOM uint32_t START_CTRL;                    /*!< 0x00000024 Start control register (firmware trigger). */
   __IM uint32_t RESERVED1[2];
  __IOM uint32_t DFT_CTRL;                      /*!< 0x00000030 DFT control register. */
   __IM uint32_t RESERVED2[19];
  __IOM uint32_t CHAN_CONFIG[32];               /*!< 0x00000080 Channel configuration register. */
   __IM uint32_t CHAN_WORK[32];                 /*!< 0x00000100 Channel working data register */
   __IM uint32_t CHAN_RESULT[32];               /*!< 0x00000180 Channel result data register */
   __IM uint32_t CHAN_WORK_UPDATED;             /*!< 0x00000200 Channel working data register 'up2025-09-19d' bits */
   __IM uint32_t CHAN_RESULT_UPDATED;           /*!< 0x00000204 Channel result data register 'up2025-09-19d' bits */
   __IM uint32_t RESERVED3[2];
  __IOM uint32_t INTR;                          /*!< 0x00000210 Interrupt request register. */
  __IOM uint32_t INTR_SET;                      /*!< 0x00000214 Interrupt set request register */
  __IOM uint32_t INTR_MASK;                     /*!< 0x00000218 Interrupt mask register. */
   __IM uint32_t INTR_MASKED;                   /*!< 0x0000021C Interrupt masked request register */
  __IOM uint32_t SATURATE_INTR;                 /*!< 0x00000220 Saturate interrupt request register. */
  __IOM uint32_t SATURATE_INTR_SET;             /*!< 0x00000224 Saturate interrupt set request register */
  __IOM uint32_t SATURATE_INTR_MASK;            /*!< 0x00000228 Saturate interrupt mask register. */
   __IM uint32_t SATURATE_INTR_MASKED;          /*!< 0x0000022C Saturate interrupt masked request register */
  __IOM uint32_t RANGE_INTR;                    /*!< 0x00000230 Range detect interrupt request register. */
  __IOM uint32_t RANGE_INTR_SET;                /*!< 0x00000234 Range detect interrupt set request register */
  __IOM uint32_t RANGE_INTR_MASK;               /*!< 0x00000238 Range detect interrupt mask register. */
   __IM uint32_t RANGE_INTR_MASKED;             /*!< 0x0000023C Range interrupt masked request register */
   __IM uint32_t INTR_CAUSE;                    /*!< 0x00000240 Interrupt cause register */
   __IM uint32_t RESERVED4[15];
  __IOM uint32_t INJ_CHAN_CONFIG;               /*!< 0x00000280 Injection channel configuration register. */
   __IM uint32_t RESERVED5[3];
   __IM uint32_t INJ_RESULT;                    /*!< 0x00000290 Injection channel result register */
   __IM uint32_t RESERVED6[3];
   __IM uint32_t STATUS;                        /*!< 0x000002A0 Current status of internal SAR registers (mostly for debug) */
   __IM uint32_t AVG_STAT;                      /*!< 0x000002A4 Current averaging status (for debug) */
   __IM uint32_t RESERVED7[22];
  __IOM uint32_t MUX_SWITCH0;                   /*!< 0x00000300 SARMUX Firmware switch controls */
  __IOM uint32_t MUX_SWITCH_CLEAR0;             /*!< 0x00000304 SARMUX Firmware switch control clear */
  __IOM uint32_t MUX_SWITCH1;                   /*!< 0x00000308 SARMUX Firmware switch controls */
  __IOM uint32_t MUX_SWITCH_CLEAR1;             /*!< 0x0000030C SARMUX Firmware switch control clear */
  __IOM uint32_t MUX_SWITCH2;                   /*!< 0x00000310 EXPMUX and DIAGMUX Firmware switch controls */
  __IOM uint32_t MUX_SWITCH_CLEAR2;             /*!< 0x00000314 EXPMUX and DIAGMUX Firmware switch control clear */
   __IM uint32_t RESERVED8[10];
  __IOM uint32_t MUX_SWITCH_HW_CTRL;            /*!< 0x00000340 SARMUX switch hardware control */
  __IOM uint32_t MUX_SWITCH_HW_CTRL2;           /*!< 0x00000344 EXPMUX and DIAGMUX switch hardware control */
   __IM uint32_t RESERVED9[2];
   __IM uint32_t MUX_SWITCH_STATUS;             /*!< 0x00000350 SARMUX switch status */
   __IM uint32_t MUX_SWITCH_STATUS2;            /*!< 0x00000354 EXPMUX and DIAGMUX switch status */
   __IM uint32_t RESERVED10[10];
  __IOM uint32_t PUMP_CTRL;                     /*!< 0x00000380 Switch pump control */
   __IM uint32_t RESERVED11[16095];
  __IOM uint32_t ANA_TRIM;                      /*!< 0x0000FF00 Analog trim register. */
  __IOM uint32_t WOUNDING;                      /*!< 0x0000FF04 SAR wounding register */
} SAR_Type;                                     /*!< Size = 65288 (0xFF08) */


